"""
TODO p.130
ПОПРОБУЙТЕ.САМИ:.ЦИКЛЫ.И.КОМАНДЫ.IF

1) Допустим, имеется список x = [1, 3, 5, 0, -1, 3, -2], из которого
нужно удалить все отрицательные числа.Напишите код для решения этой задачи.

2) Как бы вы подсчитали общее количество отрицательных чисел в списке
y = [[1, -1, 0], [2, 5, -9], [-2, -3, 0]]?
"""


"""
TODO p.132
ПОПРОБУЙТЕ.САМИ:.ГЕНЕРАТОРЫ

1) Какой генератор списков вы бы использовали для обработки списка x с 
удалением всех отрицательных выражений?

2) Создайте генератор, возвращающий только нечетные числа от 1 до 100. 
(Подсказка: нечетные числа можно отличить по наличию остатка от деления на 2; 
чтобы узнать остаток от деления на 2, используйте операцию %2.)

3) Напишите код создания словаря, содержащего числа от 11 до 15 и их кубы.
"""


"""
TODO p.139
ПРАКТИЧЕСКАЯ.РАБОТА.8:.РЕФАКТОРИНГ.WORD_COUNT
Перепишите программу word-count из раздела 8.7, чтобы сделать ее короче. 
Возможно, вам стоит вспомнить рассмотренные выше операции со строками и списками, 
а также продумать различные способы организации кода.
Также попробуйте сделать программу «умнее», чтобы словами считались только 
алфавитные строки (но не знаки препинания или специальные знаки).
"""