"""
TODO p.153
1) ПОПРОБУЙТЕ.САМИ:.ДЕКОРАТОРЫ
Как бы вы изменили код функции-декоратора, чтобы она не выдавала лишние сообщения
и заключала возвращаемое значение упакованной функции в теги "<html>" и "</html>"
и чтобы вызов myfunction("hello") возвращал "<html>hello<html>"?

2) ПРАКТИЧЕСКАЯ.РАБОТА.9:.ПОЛЕЗНЫЕ.ФУНКЦИИ
Вернитесь к практическим работам глав 6 и 7 и проведите рефакторинг, выделив код очистки
и обработки данных в отдельные функции. В результате большая часть логики должна размещаться в функциях.
Выбирайте функции и типы параметров на свое усмотрение, но помните, что функции должны
решать только одну задачу без побочных эффектов, выходящих за границы функции.
"""


